УТ/src/Catalogs/CRM_СхемаПланаПродаж/CRM_СхемаПланаПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СхемаПланаПродаж</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПериодичностьПрогнозирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлементыСхемы</name>
    <attributes>
      <name>Разрез</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ТипыАналитикПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <comment>Номер строки-родителя в табличной части</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУровня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/InformationRegisters/CRM_ПланПродаж/CRM_ПланПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ПланПродаж</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПрогноз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПрогноз</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиРодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПланаРодителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрогноз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПланПродаж</name>
    <type>
      <types>CatalogRef.CRM_ПланПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодПлана</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаПланаПродаж</name>
    <type>
      <types>CatalogRef.CRM_КлючиАналитикиПланаПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УровеньИерархии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/ChartsOfCharacteristicTypes/CRM_ТипыАналитикПланирования/CRM_ТипыАналитикПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>CRM_ТипыАналитикПланирования</name>
  <type>
    <types>CatalogRef.ВидыНоменклатуры</types>
    <types>CatalogRef.CRM_СегментыРынка</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.Партнеры</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>CatalogRef.БизнесРегионы</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.CRM_Отрасли</types>
    <types>CatalogRef.ТоварныеКатегории</types>
  </type>
  <predefined>
    <items>
      <name>Партнеры_БизнесРегион</name>
      <description>Бизнес регион</description>
      <code>000000012</code>
      <type>
        <types>CatalogRef.БизнесРегионы</types>
      </type>
    </items>
    <items>
      <name>Номенклатура_ВидНоменклатуры</name>
      <description>Вид номенклатуры</description>
      <code>000000008</code>
      <type>
        <types>CatalogRef.ВидыНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>Номенклатура_Родитель</name>
      <description>Группа номенклатуры</description>
      <code>000000010</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Менеджеры</name>
      <description>Менеджеры</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
    <items>
      <name>Номенклатура_НаправлениеДеятельности</name>
      <description>Направления деятельности</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Партнеры_ОсновнаяОтрасль</name>
      <description>Основная отрасль</description>
      <code>000000011</code>
      <type>
        <types>CatalogRef.CRM_Отрасли</types>
      </type>
    </items>
    <items>
      <name>Партнеры</name>
      <description>Партнеры</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </items>
    <items>
      <name>Подразделение</name>
      <description>Подразделение</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>Партнеры_СегментРынка</name>
      <description>Сегмент рынка</description>
      <code>000000013</code>
      <type>
        <types>CatalogRef.CRM_СегментыРынка</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Номенклатура_ТоварнаяКатегория</name>
      <description>Товарная категория</description>
      <code>000000009</code>
      <type>
        <types>CatalogRef.ТоварныеКатегории</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

УТ/src/Catalogs/CRM_СхемаПланаПродаж/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает количество уровней схемы плана продаж
//
// Параметры:
//  Схема	 - СправочникСсылка.CRM_СхемаПланаПродаж - схема плана продаж
// 
// Возвращаемое значение:
//  Число - количество уровней
//
Функция КоличествоУровней(Схема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(CRM_СхемаПланаПродажЭлементыСхемы.ИдентификаторУровня) КАК КоличествоУровней
		|ИЗ
		|	Справочник.CRM_СхемаПланаПродаж.ЭлементыСхемы КАК CRM_СхемаПланаПродажЭлементыСхемы
		|ГДЕ
		|	CRM_СхемаПланаПродажЭлементыСхемы.Ссылка = &Схема";
	
	Запрос.УстановитьПараметр("Схема", Схема);
	
	Возврат Запрос.Выполнить().Выгрузить()[0].КоличествоУровней;
	
КонецФункции

// Получает разрезы уровня иерархии
//
// Параметры:
//  Схема	 - СправочникСсылка.CRM_СхемаПланаПродаж - схема плана продаж
//  УровеньИерархии	 - Число	 - идентификатор уровня иерархии
//  ТолькоДопРазрезы - 	Булево - признак получения только дополнительных разрезов
//  ВключатьИерархию - Булево	 - признак использования иерархии
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица разрезов уровня иерархии
//
Функция РазрезыУровняИерархии(Схема, УровеньИерархии, ТолькоДопРазрезы = Истина, ВключатьИерархию = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_СхемаПланаПродажЭлементыСхемы.Разрез КАК Разрез,
		|	CRM_СхемаПланаПродажЭлементыСхемы.ИдентификаторУровня КАК Уровень
		|ИЗ
		|	Справочник.CRM_СхемаПланаПродаж.ЭлементыСхемы КАК CRM_СхемаПланаПродажЭлементыСхемы
		|ГДЕ
		|	CRM_СхемаПланаПродажЭлементыСхемы.Ссылка = &Схема
		|	И CRM_СхемаПланаПродажЭлементыСхемы.ИдентификаторУровня = &УровеньИерархии
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_СхемаПланаПродажЭлементыСхемы.НомерСтроки";
	
	Если ВключатьИерархию Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
									"CRM_СхемаПланаПродажЭлементыСхемы.ИдентификаторУровня = &УровеньИерархии", 
									"CRM_СхемаПланаПродажЭлементыСхемы.ИдентификаторУровня <= &УровеньИерархии");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.УстановитьПараметр("УровеньИерархии", УровеньИерархии);
	
	РезультатЗапросаТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТолькоДопРазрезы Тогда
		
		СтрокиКУдалению = Новый Массив;
		Для Каждого СтрокаТЗ Из РезультатЗапросаТЗ Цикл
			Если ЭтоТипИерархии(СтрокаТЗ.Разрез) Тогда
				СтрокиКУдалению.Добавить(СтрокаТЗ);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЭлСтрокиКУдалению Из СтрокиКУдалению Цикл
			РезультатЗапросаТЗ.Удалить(ЭлСтрокиКУдалению);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РезультатЗапросаТЗ;
	
КонецФункции

// Проверяет, что уровень содержит тип иерархии
//
// Параметры:
//  Схема			 - СправочникСсылка.CRM_СхемаПланаПродаж - схема плана продаж
//  УровеньИерархии	 - Число								 - идентификатор уровня иерархии
//  ТипИерархии		 - ОписаниеТипов						 - тип иерархии
// 
// Возвращаемое значение:
//  Булево - результат выполнения функции
//
Функция УровеньСодержитТипИерархии(Схема, УровеньИерархии, ТипИерархии) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_СхемаПланаПродажЭлементыСхемы.Разрез КАК Разрез
		|ИЗ
		|	Справочник.CRM_СхемаПланаПродаж.ЭлементыСхемы КАК CRM_СхемаПланаПродажЭлементыСхемы
		|ГДЕ
		|	CRM_СхемаПланаПродажЭлементыСхемы.Ссылка = &Схема
		|	И CRM_СхемаПланаПродажЭлементыСхемы.ИдентификаторУровня = &УровеньИерархии";
	
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.УстановитьПараметр("УровеньИерархии", УровеньИерархии);
	
	РезультатЗапросаТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЗ Из РезультатЗапросаТЗ Цикл
		Если СтрокаТЗ.Разрез.ТипЗначения.СодержитТип(ТипИерархии) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Ложь;
	
КонецФункции

// Возвращает значение периодичности уровня схемы
//
// Параметры:
//  Схема			 - СправочникСсылка.CRM_СхемаПланаПродаж - схема плана продаж
//  УровеньИерархии	 - Число								 - идентификатор уровня иерархии
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.Периодичность - периодичность уровня схемы
//
Функция ПериодичностьУровняСхемы(Схема, УровеньИерархии) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_СхемаПланаПродажЭлементыСхемы.Периодичность КАК Периодичность
		|ИЗ
		|	Справочник.CRM_СхемаПланаПродаж.ЭлементыСхемы КАК CRM_СхемаПланаПродажЭлементыСхемы
		|ГДЕ
		|	CRM_СхемаПланаПродажЭлементыСхемы.Ссылка = &Схема
		|	И CRM_СхемаПланаПродажЭлементыСхемы.ИдентификаторУровня = &УровеньИерархии";
	
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.УстановитьПараметр("УровеньИерархии", УровеньИерархии);
	
	ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаИзРезультатаЗапроса.Следующий() Тогда
		Возврат ВыборкаИзРезультатаЗапроса.Периодичность;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает значение периодичности прогнозирования
//
// Параметры:
//  Схема			 - СправочникСсылка.CRM_СхемаПланаПродаж - схема плана продаж
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.Периодичность - периодичность прогнозирования
//
Функция ПериодичностьПрогнозирования(Схема) Экспорт
	
	Возврат Схема.ПериодичностьПрогнозирования;
	
КонецФункции

#Область ПереходНаНовуюВерсию

// Процедура выполняет создание поставляемых схем.
//
// Параметры:
//  Параметры	 - Структура	 - Параметры.
//
Процедура СоздатьПоставляемыеСхемы(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СхемаПланаПродаж.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_СхемаПланаПродаж КАК CRM_СхемаПланаПродаж");
	
	Если Запрос.Выполнить().Пустой() Тогда
		
		// По менеджерам подразделения / на квартал
		НовСхема = СоздатьЭлемент();
		НовСхема.Наименование = НСтр("ru = 'По менеджерам подразделения / на квартал'");
		НовСхема.ПериодичностьПрогнозирования = Перечисления.Периодичность.Месяц;
		// Менеджеры
		НовЭлемент = НовСхема.ЭлементыСхемы.Добавить();
		НовЭлемент.Разрез = ПланыВидовХарактеристик.CRM_ТипыАналитикПланирования.Менеджеры;
        НовЭлемент.ИдентификаторУровня = 1;
        НовЭлемент.Периодичность = Перечисления.Периодичность.Квартал;
		// Группа номенклатуры
		НовЭлемент = НовСхема.ЭлементыСхемы.Добавить();
		НовЭлемент.Разрез = ПланыВидовХарактеристик.CRM_ТипыАналитикПланирования.Номенклатура_Родитель;
        НовЭлемент.Родитель = 1;
        НовЭлемент.ИдентификаторУровня = 1;
        НовЭлемент.Периодичность = Перечисления.Периодичность.Квартал;
		// Группа номенклатуры
		НовЭлемент = НовСхема.ЭлементыСхемы.Добавить();
		НовЭлемент.Разрез = ПланыВидовХарактеристик.CRM_ТипыАналитикПланирования.Партнеры;
        НовЭлемент.Родитель = 1;
        НовЭлемент.ИдентификаторУровня = 1;
        НовЭлемент.Периодичность = Перечисления.Периодичность.Квартал;
		
		НовСхема.Записать();

		// По подразделениям продаж / на год
		НовСхема = СоздатьЭлемент();
		НовСхема.Наименование = НСтр("ru = 'По подразделениям продаж / на год'");
		НовСхема.ПериодичностьПрогнозирования = Перечисления.Периодичность.Месяц;
		// Подразделение
		НовЭлемент = НовСхема.ЭлементыСхемы.Добавить();
		НовЭлемент.Разрез = ПланыВидовХарактеристик.CRM_ТипыАналитикПланирования.Подразделение;
        НовЭлемент.ИдентификаторУровня = 1;
        НовЭлемент.Периодичность = Перечисления.Периодичность.Год;
		// Менеджеры
		НовЭлемент = НовСхема.ЭлементыСхемы.Добавить();
		НовЭлемент.Разрез = ПланыВидовХарактеристик.CRM_ТипыАналитикПланирования.Менеджеры;
        НовЭлемент.Родитель = 1;
        НовЭлемент.ИдентификаторУровня = 2;
        НовЭлемент.Периодичность = Перечисления.Периодичность.Месяц;
		// Группа номенклатуры
		НовЭлемент = НовСхема.ЭлементыСхемы.Добавить();
		НовЭлемент.Разрез = ПланыВидовХарактеристик.CRM_ТипыАналитикПланирования.Партнеры;
        НовЭлемент.Родитель = 2;
        НовЭлемент.ИдентификаторУровня = 2;
        НовЭлемент.Периодичность = Перечисления.Периодичность.Месяц;
		
		НовСхема.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоТипИерархии(Разрез) Экспорт
	
	Если Разрез.ТипЗначения.СодержитТип(Тип("СправочникСсылка.СтруктураПредприятия"))
		Или Разрез.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоПериодичность(Разрез) Экспорт
	
	Если ТипЗнч(Разрез) = Тип("ПеречислениеСсылка.Периодичность") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьЗаписиСоСвязаннымиПланамиПродаж(Схема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_ПланПродаж.ПланПродаж КАК ПланПродаж
		|ИЗ
		|	РегистрСведений.CRM_ПланПродаж КАК CRM_ПланПродаж
		|ГДЕ
		|	CRM_ПланПродаж.ПланПродаж.СхемаПланаПродаж = &СхемаПланаПродаж
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_ПланПродаж.ПланПродаж";
	
	Запрос.УстановитьПараметр("СхемаПланаПродаж", Схема);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
